<template>
  <q-layout>
    <MainNavigation />
    <q-page-container>
      <div class="MN_about_author">
        <div class="about_image_wrap hide_image">
          <img
            class="MN_about_author_img"
            src="../assets/png/MN_Lena_1_2.png"
            alt="MN_Lena_1_2"
          />
        </div>
        <div class="">
          <p>
            Меня зовут Елена Шадрина, и я помогу вам разобраться в
            психологических причинах накопившихся проблем и улучшить качество
            вашей жизни. Я 1986 года рождения (сразу можете посчитать, сколько
            мне лет). В школе (на самом деле в гимназии) я училась в
            естественно-научном классе, пристрастилась к биологии и химии, даже
            поступила в ЯГТУ на машиностроительный факультет (откуда потом
            благополучно ушла) Как себя помню – всегда была психологом, но
            официально стала им в 2009 году, когда получила долгожданный диплом
            о высшем образовании. Потом получила второй диплом (клинического
            психолога, тоже долгожданный) но об этом в разделе образование.
            Долго мотало меня в подходах и направлениях психологии, но в итоге я
            остановилась на КПТ или когнитивно-поведенческой психотерапии.
            Именно в рамках этого подхода я работаю с людьми от 16 до 55 лет,
            специализируюсь на спектре тревожных расстройств, депрессии и
            писательской прокрастинации (это делаю, потому что сама писатель).
            Постоянно прохожу какое-нибудь обучение, касающееся сферы моей
            работы: фобии, ипохондрия, социальная тревожность, психогенная
            депрессия. Так же работаю с людьми с расстройствами личности и
            психотическим уровнем расстройств в паре с психиатром (спектр
            аффективных расстройств – биполярное 1 и 2го типа, циклотимия).
          </p>
          <p>
            Вот несколько фактов обо мне: - после ВУЗа работала в сфере подбора
            персонала и вела тренинги; - сейчас увлеклась психологией
            профессиональной деятельности и теориями, которые объясняют, почему
            человек выбирает ту или иную профессию; - изучаю мотивы создания
            творческих объектов и роль творчества в жизнь человека и общества; -
            интересуюсь сферой общения врач-пациент и причинами
            профессионального выгорания врачей; - регулярно посещаю конференции
            по суицидологи; - у меня РАС и СДВГ (степень легкая, но иногда и
            такая степень здорово мешает); Люблю черный жесткий юмор и топлю за
            науку. Борюсь против мракобесия. Состою в ассоциации
            когнитивно-поведенческих психотерапевтов и в Союзе Российских
            писателей. Консультирую индивидуально и веду группы.
          </p>
        </div>
      </div>
    </q-page-container>

    <MainFooter />
  </q-layout>
</template>

<script>
import { defineComponent, ref } from "vue";
import "animate.css";

import MainNavigation from "components/home/MainNavigation.vue";
import MainFooter from "components/home/MainFooter.vue";

export default defineComponent({
  // name: "MainLayout",

  components: {
    MainNavigation,
    MainFooter,
  },

  setup() {
    return {};
  },
});
</script>

<style scoped>
.MN_about_author {
  display: flex;
  align-items: center;
  justify-content: center;
}

.MN_about_author_img {
  max-width: 1440px;
  height: 500px;
}
</style>
